In [1]:
!pip install mysql.connector

Collecting mysql.connector
  Downloading https://files.pythonhosted.org/packages/28/04/e40098f3730e75bbe36a338926f566ea803550a34fb50535499f4fc4787a/mysql-connector-2.2.9.tar.gz (11.9MB)
     |████████████████████████████████| 11.9MB 195kB/s
Building wheels for collected packages: mysql.connector
  Building wheel for mysql.connector (setup.py) ... done
  Created wheel for mysql.connector: filename=mysql_connector-2.2.9-cp36-cp36m-linux_x86_64.whl size=247949 sha256=d91b33540604c3e24b9d5dc6c5b076630ccf19cf5f8ed7d14fb2a5e739795ac9
  Stored in directory: /root/.cache/pip/wheels/8c/83/a1/f8b6d4bb1bd6208bbde1608bbfa7557504bed9eaf2ecf8c175
Successfully built mysql.connector
Installing collected packages: mysql.connector
Successfully installed mysql.connector

In [3]:
import mysql.connector
from mysql.connector import Error

try:
    connection = mysql.connector.connect(host='db4free.net',
                                         database='eoitest',
                                         user='eoitest',
                                         password='eoitest2019')
    if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL Server version ", db_Info)
        cursor = connection.cursor()
        cursor.execute("select database();")
        record = cursor.fetchone()
        print("You're connected to database: ", record)

except Error as e:
    print("Error while connecting to MySQL", e)
finally:
    if (connection.is_connected()):
        cursor.close()
        connection.close()
        print("MySQL connection is closed")

Connected to MySQL Server version  8.0.18
You're connected to database:  ('eoitest',)
MySQL connection is closed

In [4]:
#Ejemplo de consulta
connection = mysql.connector.connect(host='db4free.net',
                                         database='eoitest',
                                         user='eoitest',
                                         password='eoitest2019')
sql_select_Query = "select * from bigbang"
cursor = connection.cursor()
cursor.execute(sql_select_Query)
records = cursor.fetchall()
print("Total from table: ", cursor.rowcount)

for row in records:
  print(row)
cursor.close()
connection.close()

Total from table:  8
('Sheldon', 'Cooper', 33, 'Fisico')
('Leonard', 'Nose', 33, 'Fisico')
('Penny', 'Nose', 31, 'Actriz')
('Amy', 'Faranoseque', 30, 'Neurologa')
('Rash', 'kuzrrapali', 34, 'Astrofisico')
('Ines', 'Huertas', 35, 'DS')
('Prueba', 'Test', 33, 'blablba')
('Prueba', 'Test', 33, 'blablba')

In [5]:
#Ejemplo querie datos convertido a dataframe
from pandas import DataFrame

connection = mysql.connector.connect(host='db4free.net',
                                         database='eoitest',
                                         user='eoitest',
                                         password='eoitest2019')
sql_select_Query = "select * from bigbang"
cursor = connection.cursor()
cursor.execute(sql_select_Query)
records = cursor.fetchall()
print("Total from table: ", cursor.rowcount)

df = DataFrame(records)
df.columns = cursor.column_names
print(df)

cursor.close()
connection.close()

Total from table:  8
    Nombre     Apellido  Edad    Profesion
0  Sheldon       Cooper    33       Fisico
1  Leonard         Nose    33       Fisico
2    Penny         Nose    31       Actriz
3      Amy  Faranoseque    30    Neurologa
4     Rash   kuzrrapali    34  Astrofisico
5     Ines      Huertas    35           DS
6   Prueba         Test    33      blablba
7   Prueba         Test    33      blablba

In [7]:
#Ejemplo insertar y obtener
connection = mysql.connector.connect(host='db4free.net',
                                         database='eoitest',
                                         user='eoitest',
                                         password='eoitest2019')

mySql_insert_query = "INSERT INTO bigbang (Nombre, Apellido, Edad, Profesion) VALUES  ('MiInsert','MiInsert',33,'Profe')"
cursor = connection.cursor()
result = cursor.execute(mySql_insert_query)
connection.commit()

sql_select_Query = "select * from bigbang"
cursor.execute(sql_select_Query)
records = cursor.fetchall()

df = DataFrame(records)
df.columns = cursor.column_names
print(df)

cursor.close()
connection.close()

     Nombre     Apellido  Edad    Profesion
0   Sheldon       Cooper    33       Fisico
1   Leonard         Nose    33       Fisico
2     Penny         Nose    31       Actriz
3       Amy  Faranoseque    30    Neurologa
4      Rash   kuzrrapali    34  Astrofisico
5      Ines      Huertas    35           DS
6    Prueba         Test    33      blablba
7    Prueba         Test    33      blablba
8  MiInsert     MiInsert    33        Profe

In [10]:
#Ejemplo insertar y obtener
connection = mysql.connector.connect(host='db4free.net',
                                         database='eoitest',
                                         user='eoitest',
                                         password='eoitest2019')
sql_Delete_query = "Delete from bigbang where Nombre='Leonard'"
cursor = connection.cursor()
cursor.execute(sql_Delete_query)
connection.commit()

sql_select_Query = "select * from bigbang"
cursor.execute(sql_select_Query)
records = cursor.fetchall()

df = DataFrame(records)
df.columns = cursor.column_names
print(df)

cursor.close()
connection.close()

     Nombre     Apellido  Edad    Profesion
0   Sheldon       Cooper    33       Fisico
1     Penny         Nose    31       Actriz
2       Amy  Faranoseque    30    Neurologa
3      Rash   kuzrrapali    34  Astrofisico
4      Ines      Huertas    35           DS
5    Prueba         Test    33      blablba
6    Prueba         Test    33      blablba
7  MiInsert     MiInsert    33        Profe

In [0]:
import mysql.connector
from mysql.connector import Error